; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-18)
(:domain gripper-strips)
(:objects rooma roomb left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 )
(:init
(room rooma)
(room roomb)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 18
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 10 of 18
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 18
4. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 11 of 18
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 18
6. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 11 of 18
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 18
8. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 12 of 18
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 18
10. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 12 of 18
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 18
12. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 13 of 18
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 18
14. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 13 of 18
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 18
16. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 14 of 18
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 18
18. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 14 of 18
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 18
20. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 15 of 18
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 18
22. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 15 of 18
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 18
24. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 16 of 18
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 18
26. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 16 of 18
27. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 16 of 18
28. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 17 of 18
29. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 18
30. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 17 of 18
31. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 17 of 18
32. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 18 of 18
